test/OpenFOAM/test2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.5 -0.5)
    ( 0.5 -0.5 -0.5)
    ( 0.5  0.5 -0.5)
    (-0.5  0.5 -0.5)
    (-0.5 -0.5  0.5)
    ( 0.5 -0.5  0.5)
    ( 0.5  0.5  0.5)
    (-0.5  0.5  0.5)
);

//                             
//                             
//                             
//           change this numbers for finer meshes
//                             
//                            |
//                            |
//                            v
blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 32) simpleGrading (1 1 1)
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
